<a href="https://colab.research.google.com/github/2403A52284/Batch-11-12/blob/main/Preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
## Data Wrangling steps
## filling null values
## duplicates
## dropnull
## rename
## add new column
## sorting

In [39]:
import pandas as pd
import numpy as np
data={
    "Name":["Alice","Bob","Charlie","David","Eve","Alice","Charlie"],
    "Age":[25,48,None,40,25,30,None],
    "City":["New York","London",None,"Paris","Berlin","New York",None],
    "Salary":[50000,60000,None,80000,90000,50000,None],
}
df=pd.DataFrame(data)
print(df)

      Name   Age      City   Salary
0    Alice  25.0  New York  50000.0
1      Bob  48.0    London  60000.0
2  Charlie   NaN      None      NaN
3    David  40.0     Paris  80000.0
4      Eve  25.0    Berlin  90000.0
5    Alice  30.0  New York  50000.0
6  Charlie   NaN      None      NaN

In [43]:
df['Age']=df['Age'].fillna(df['Age'].mean())
df['City']=df['City'].fillna("Unknown")
df=df.dropna(subset=['Salary'])
print(df)

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob  48.0    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve  25.0    Berlin  90000.0
5  Alice  30.0  New York  50000.0

In [42]:
df = df.drop_duplicates()
print(df)

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob  48.0    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve  25.0    Berlin  90000.0
5  Alice  30.0  New York  50000.0

In [46]:
df = df.rename(columns={"Name": "Employee_Name", "Age": "Employee_Age"})
print(df)

  Employee_Name  Employee_Age      City   Salary
0         Alice          25.0  New York  50000.0
1           Bob          48.0    London  60000.0
3         David          40.0     Paris  80000.0
4           Eve          25.0    Berlin  90000.0
5         Alice          30.0  New York  50000.0

In [47]:
df['Employee_Age'] = df['Employee_Age'].astype(int)   # convert float â†’ int
print(df)

  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            48    London  60000.0
3         David            40     Paris  80000.0
4           Eve            25    Berlin  90000.0
5         Alice            30  New York  50000.0

In [48]:
df_filtered = df[df['Salary'] > 60000]   # employees with salary > 60000
print(df)

  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            48    London  60000.0
3         David            40     Paris  80000.0
4           Eve            25    Berlin  90000.0
5         Alice            30  New York  50000.0

In [49]:
df['Bonus'] = df['Salary'] * 0.10   # 10% bonus
print(df)

  Employee_Name  Employee_Age      City   Salary   Bonus
0         Alice            25  New York  50000.0  5000.0
1           Bob            48    London  60000.0  6000.0
3         David            40     Paris  80000.0  8000.0
4           Eve            25    Berlin  90000.0  9000.0
5         Alice            30  New York  50000.0  5000.0

In [50]:
df = df.sort_values(by='Salary', ascending=False)
print(df)

  Employee_Name  Employee_Age      City   Salary   Bonus
4           Eve            25    Berlin  90000.0  9000.0
3         David            40     Paris  80000.0  8000.0
1           Bob            48    London  60000.0  6000.0
0         Alice            25  New York  50000.0  5000.0
5         Alice            30  New York  50000.0  5000.0

In [51]:
df_group = df.groupby('City')['Salary'].mean()
print(df_group)

City
Berlin      90000.0
London      60000.0
New York    50000.0
Paris       80000.0
Name: Salary, dtype: float64